// 膀胱功能
const 膀胱默认值 = {
    膀胱按钮文本:"膀胱设置",
    膀胱设置按钮位置:[400,300],
    膀胱设置按钮大小:[300,200]
}; 
let 膀胱设置 = {
    设置:{...膀胱默认值}
};

class 膀胱类 {
    constructor(膀胱设置){
        this.参数 = 膀胱设置;
    }

    渲染设置() {
        // 选择主界面设置子按钮
        DrawButton(this.参数.设置.膀胱设置按钮位置[0],
                    this.参数.设置.膀胱设置按钮位置[1], 
                    this.参数.设置.膀胱设置按钮大小[0],
                    this.参数.设置.膀胱设置按钮大小[1], this.参数.设置.膀胱按钮文本, 
                    "White", 
                    "");
    }
}

export let 膀胱 = new 膀胱类(膀胱设置);